<a href="https://colab.research.google.com/github/michalis0/DataMining_and_MachineLearning/blob/master/week3/Exercises/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Mining and Machine Learning - Week 3
# Exercises

### Table of Contents
#### Exercise 1: Advanced Pandas Operations
#### Exercise 2: EDA and Visualization

## Exercise 1: Advanced Pandas Operations

In [1]:
# Import requiered packages
import pandas as pd
import matplotlib.pyplot as plt

### A. Merge
In this simple exercise, we illustrate the concepts of inner, outer, left and right joins.

In [2]:
# Create a first DataFrame
data_1 = {'ID':  ['12345678', '11223344', '87654321', '44332211'],
        'First Name': ['George', 'Abraham', 'Harry S.', 'Richard'],
         'Last Name': ['Washington', 'Lincoln', 'Truman', 'Nixon'],
          'Party': ['Unaffiliated', 'Republican', 'Democratic', 'Republican'],
        }

df_1 = pd.DataFrame(data_1)

df_1

         ID First Name   Last Name         Party
0  12345678     George  Washington  Unaffiliated
1  11223344    Abraham     Lincoln    Republican
2  87654321   Harry S.      Truman    Democratic
3  44332211    Richard       Nixon    Republican

In [3]:
# Create a second DataFrame
data_2 = {'ID':  ['12345678', '11223344', '88888888', '44332211', '11111111', '22222222', '33333333'],
        'Grade': [4, 2.5, 5.5, 6, 3.5, 4, 4]
        }

df_2 = pd.DataFrame(data_2)

df_2

         ID  Grade
0  12345678    4.0
1  11223344    2.5
2  88888888    5.5
3  44332211    6.0
4  11111111    3.5
5  22222222    4.0
6  33333333    4.0

###### A.1 Merge the two DataFrames using an inner join. How many columns and rows has the resulting DataFrame?

In [4]:
# [YOUR SOLUTION]

###### A.2 Merge the two DataFrames using an outer join. How many columns and rows has the resulting DataFrame?

In [5]:
# [YOUR SOLUTION]

###### A.3 Merge the two DataFrames using a left join, where `df_1` is on the left and `df_2` on the right. How many columns and rows has the resulting DataFrame?

In [6]:
# [YOUR SOLUTION]

### B. Aggregation
We use the car data available on the github repository.

In [7]:
# Import data
cars = pd.read_csv("https://raw.githubusercontent.com/michalis0/DataMining_and_MachineLearning/master/week3/data/cars.csv", sep=",")

cars.head()

   YEAR        Make           Model        Size  ...  (g/km) RATING (km)  TIME (h)
0  2012  MITSUBISHI          i-MiEV  SUBCOMPACT  ...       0    NaN  100         7
1  2012      NISSAN            LEAF    MID-SIZE  ...       0    NaN  117         7
2  2013        FORD  FOCUS ELECTRIC     COMPACT  ...       0    NaN  122         4
3  2013  MITSUBISHI          i-MiEV  SUBCOMPACT  ...       0    NaN  100         7
4  2013      NISSAN            LEAF    MID-SIZE  ...       0    NaN  117         7

[5 rows x 17 columns]

In [8]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   YEAR               53 non-null     int64
 1   Make               53 non-null     object
 2   Model              53 non-null     object
 3   Size               53 non-null     object
 4   (kW)               53 non-null     int64
 5   Unnamed: 5         53 non-null     object
 6   TYPE               53 non-null     object
 7   CITY (kWh/100 km)  53 non-null     float64
 8   HWY (kWh/100 km)   53 non-null     float64
 9   COMB (kWh/100 km)  53 non-null     float64
 10  CITY (Le/100 km)   53 non-null     float64
 11  HWY (Le/100 km)    53 non-null     float64
 12  COMB (Le/100 km)   53 non-null     float64
 13  (g/km)             53 non-null     int64
 14  RATING             19 non-null     float64
 15  (km)               53 non-null     int64
 16  TIME (h)           53 non-null     int64
dtypes: float64(7), int64(5), object(5)
memory usage: 7.2+ KB

###### B.1 Find the average `(kW)` per `Make`. Plot the result using a bar plot.

In [9]:
# [YOUR SOLUTION]

###### B.2 Select the two most powerful vehicules per year

In [10]:
# [YOUR SOLUTION]

## Exercise 2: EDA and Visualization
For this exercise, we use NBA data available on the github repository.

In [11]:
# Import data
nba = pd.read_csv("https://raw.githubusercontent.com/michalis0/DataMining_and_MachineLearning/master/week3/data/nba_stats.csv", sep=",")

nba.head()

   Year        Player Pos  Age   Tm    MP  ...  AST  STL  BLK  TOV   PF  PTS
0  2017   Ivica Zubac   C   19  LAL   609  ...   30   14   33   30   66  284
1  2017  Gerald Green  SF   31  BOS   538  ...   33    9    7   25   48  262
2  2017   Danny Green  SG   29  SAS  1807  ...  124   71   58   76  120  497
3  2017  Jerian Grant  PG   24  CHI  1028  ...  120   47    8   44   93  370
4  2017  Jerami Grant  SF   22  OKC  1490  ...   46   33   75   41  144  421

[5 rows x 14 columns]

In [12]:
nba.tail()

       Year          Player Pos  Age   Tm    MP  ...  AST  STL  BLK  TOV   PF   PTS
19640  1978     Eddie Owens  SF   24  BUF    63  ...    5    1    0    3    9    21
19641  1978       Tom Owens   C   28  POR  1714  ...  160   33   37  152  263   832
19642  1978        Joe Pace   C   24  WSB   438  ...   23   12   21   44   86   191
19643  1978  Robert Parish*   C   24  GSW  1969  ...   95   79  123  201  291  1025
19644  1978  Willie Norwood  SF   30  DET   260  ...   14   13    3   17   45    88

[5 rows x 14 columns]

In [13]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19645 entries, 0 to 19644
Data columns (total 14 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    19645 non-null  int64
 1   Player  19645 non-null  object
 2   Pos     19645 non-null  object
 3   Age     19645 non-null  int64
 4   Tm      19645 non-null  object
 5   MP      19645 non-null  int64
 6   FT      19645 non-null  int64
 7   TRB     19645 non-null  int64
 8   AST     19645 non-null  int64
 9   STL     19645 non-null  int64
 10  BLK     19645 non-null  int64
 11  TOV     19645 non-null  int64
 12  PF      19645 non-null  int64
 13  PTS     19645 non-null  int64
dtypes: int64(11), object(3)
memory usage: 2.1+ MB

###### 1. Find the average age of the players for the year 2017.

In [14]:
# [YOUR SOLUTION]

###### 2. Plot the total number of `PTS` per year since 2000.

In [15]:
# [YOUR SOLUTION]

###### 3. Plot the number of players per year since 2010. What is the year with the most players?

In [16]:
# [YOUR SOLUTION]